tiborsimon/embedded-tdd-headers/pic/8bit/pic16f753_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F753_H_
#define _PIC16F753_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP1                           9
#define IRP                           10
#define PORTA                         11
#define RA0                           12
#define RA1                           13
#define RA2                           14
#define RA3                           15
#define RA4                           16
#define RA5                           17
#define PORTC                         18
#define RC0                           19
#define RC1                           20
#define RC2                           21
#define RC3                           22
#define RC4                           23
#define RC5                           24
#define IOCAF                         25
#define IOCAF0                        26
#define IOCAF1                        27
#define IOCAF2                        28
#define IOCAF3                        29
#define IOCAF4                        30
#define IOCAF5                        31
#define IOCCF                         32
#define IOCCF0                        33
#define IOCCF1                        34
#define IOCCF2                        35
#define IOCCF3                        36
#define IOCCF4                        37
#define IOCCF5                        38
#define INTCON                        39
#define IOCIF                         40
#define INTF                          41
#define T0IF                          42
#define IOCIE                         43
#define INTE                          44
#define T0IE                          45
#define PEIE                          46
#define GIE                           47
#define PIR1                          48
#define TMR1IF                        49
#define TMR2IF                        50
#define HLTMR1IF                      51
#define HLTMR2IF                      52
#define ADIF                          53
#define TMR1GIF                       54
#define PIR2                          55
#define CCP1IF                        56
#define COG1IF                        57
#define C1IF                          58
#define C2IF                          59
#define T1CON                         60
#define TMR1ON                        61
#define nT1SYNC                       62
#define T1CKPS0                       63
#define T1CKPS                        64
#define T1CKPS1                       65
#define TMR1CS0                       66
#define TMR1CS                        67
#define TMR1CS1                       68
#define T1GCON                        69
#define T1GSS0                        70
#define T1GSS                         71
#define T1GSS1                        72
#define T1GVAL                        73
#define T1GGO_nDONE                   74
#define T1GGO                         75
#define T1GSPM                        76
#define T1GTM                         77
#define T1GPOL                        78
#define TMR1GE                        79
#define CCP1CON                       80
#define CCP1M0                        81
#define CCP1M                         82
#define CCP1M1                        83
#define CCP1M2                        84
#define CCP1M3                        85
#define DC1B                          86
#define DC1B0                         87
#define DC1B1                         88
#define ADRESL                        89
#define ADRESH                        90
#define ADCON0                        91
#define ADON                          92
#define GO_nDONE                      93
#define CHS                           94
#define CHS0                          95
#define CHS1                          96
#define CHS2                          97
#define CHS3                          98
#define ADFM                          99
#define ADCON1                        100
#define ADPREF1                       101
#define ADCS0                         102
#define ADCS                          103
#define ADCS1                         104
#define ADCS2                         105
#define OPTION_REG                    106
#define PS                            107
#define PS0                           108
#define PS1                           109
#define PS2                           110
#define PSA                           111
#define T0SE                          112
#define T0CS                          113
#define INTEDG                        114
#define nRAPU                         115
#define TRISA                         116
#define TRISA0                        117
#define TRISA1                        118
#define TRISA2                        119
#define TRISA3                        120
#define TRISA4                        121
#define TRISA5                        122
#define TRISC                         123
#define TRISC0                        124
#define TRISC1                        125
#define TRISC2                        126
#define TRISC3                        127
#define TRISC4                        128
#define TRISC5                        129
#define IOCAP                         130
#define IOCAP0                        131
#define IOCAP1                        132
#define IOCAP2                        133
#define IOCAP3                        134
#define IOCAP4                        135
#define IOCAP5                        136
#define IOCCP                         137
#define IOCCP0                        138
#define IOCCP1                        139
#define IOCCP2                        140
#define IOCCP3                        141
#define IOCCP4                        142
#define IOCCP5                        143
#define PIE1                          144
#define TMR1IE                        145
#define TMR2IE                        146
#define HLTMR1IE                      147
#define HLTMR2IE                      148
#define ADIE                          149
#define TMR1GIE                       150
#define PIE2                          151
#define CCP1IE                        152
#define COG1IE                        153
#define C1IE                          154
#define C2IE                          155
#define OSCCON                        156
#define LTS                           157
#define HTS                           158
#define IRCF                          159
#define IRCF0                         160
#define IRCF1                         161
#define FVR1CON0                      162
#define FVRBUFEN                      163
#define FVRBUFSS0                     164
#define FVRBUSS0                      165
#define FVRBUSS1                      166
#define FVROE                         167
#define FVRRDY                        168
#define FVREN                         169
#define DAC1CON0                      170
#define DACPSS                        171
#define DACPSS0                       172
#define DACPSS1                       173
#define DACOE                         174
#define DACFM                         175
#define DACEN                         176
#define DAC1REFL                      177
#define DAC1REFL_DACR                 178
#define DAC1REFH                      179
#define DAC1REFH_DACR                 180
#define OPA1CON                       181
#define OPA1PCH                       182
#define OPA1PCH0                      183
#define OPA1PCH1                      184
#define OPA1NCH0                      185
#define OPA1NCH                       186
#define OPA1NCH1                      187
#define OPAUGM                        188
#define OPAEN                         189
#define CM2CON0                       190
#define C2SYNC                        191
#define C2HYS                         192
#define C2SP                          193
#define C2ZLF                         194
#define C2POL                         195
#define C2OE                          196
#define C2OUT                         197
#define C2ON                          198
#define CM2CON1                       199
#define C2NCH0                        200
#define C2NCH                         201
#define C2NCH1                        202
#define C2NCH2                        203
#define C2PCH                         204
#define C2PCH0                        205
#define C2PCH1                        206
#define C2PCH2                        207
#define C2INTN                        208
#define C2INTP                        209
#define CM1CON0                       210
#define C1SYNC                        211
#define C1HYS                         212
#define C1SP                          213
#define C1ZLF                         214
#define C1POL                         215
#define C1OE                          216
#define C1OUT                         217
#define C1ON                          218
#define CM1CON1                       219
#define C1NCH0                        220
#define C1NCH                         221
#define C1NCH1                        222
#define C1NCH2                        223
#define C1PCH                         224
#define C1PCH0                        225
#define C1PCH1                        226
#define C1PCH2                        227
#define C1INTN                        228
#define C1INTP                        229
#define CMOUT                         230
#define MCOUT1                        231
#define MCOUT2                        232
#define LATA                          233
#define LATA0                         234
#define LATA1                         235
#define LATA2                         236
#define LATA4                         237
#define LATA5                         238
#define LATC                          239
#define LATC0                         240
#define LATC1                         241
#define LATC2                         242
#define LATC3                         243
#define LATC4                         244
#define LATC5                         245
#define IOCAN                         246
#define IOCAN0                        247
#define IOCAN1                        248
#define IOCAN2                        249
#define IOCAN3                        250
#define IOCAN4                        251
#define IOCAN5                        252
#define IOCCN                         253
#define IOCCN0                        254
#define IOCCN1                        255
#define IOCCN2                        256
#define IOCCN3                        257
#define IOCCN4                        258
#define IOCCN5                        259
#define WPUA                          260
#define WPUA0                         261
#define WPUA1                         262
#define WPUA2                         263
#define WPUA3                         264
#define WPUA4                         265
#define WPUA5                         266
#define WPUC                          267
#define WPUC0                         268
#define WPUC1                         269
#define WPUC2                         270
#define WPUC3                         271
#define WPUC4                         272
#define WPUC5                         273
#define SLRCONC                       274
#define SLRC4                         275
#define SLRC5                         276
#define PCON                          277
#define nBOR                          278
#define nPOR                          279
#define TMR2                          280
#define PR2                           281
#define T2CON                         282
#define T2CKPS0                       283
#define T2CKPS                        284
#define T2CKPS1                       285
#define TMR2ON                        286
#define T2OUTPS0                      287
#define T2OUTPS                       288
#define T2OUTPS1                      289
#define T2OUTPS2                      290
#define T2OUTPS3                      291
#define HLTMR1                        292
#define HLTPR1                        293
#define HLT1CON0                      294
#define H1CKPS                        295
#define H1CKPS0                       296
#define H1CKPS1                       297
#define H1ON                          298
#define H1OUTPS                       299
#define H1OUTPS0                      300
#define H1OUTPS1                      301
#define H1OUTPS2                      302
#define H1OUTPS3                      303
#define HLT1CON1                      304
#define H1REREN                       305
#define H1FEREN                       306
#define H1ERS                         307
#define H1ERS0                        308
#define H1ERS1                        309
#define H1ERS2                        310
#define H1RES                         311
#define H1FES                         312
#define HLTMR2                        313
#define HLTPR2                        314
#define HLT2CON0                      315
#define H2CKPS0                       316
#define H2CKPS                        317
#define H2CKPS1                       318
#define H2ON                          319
#define H2OUTPS0                      320
#define H2OUTPS                       321
#define H2OUTPS1                      322
#define H2OUTPS2                      323
#define H2OUTPS3                      324
#define HLT2CON1                      325
#define H2REREN                       326
#define H2FEREN                       327
#define H2ERS0                        328
#define H2ERS                         329
#define H2ERS1                        330
#define H2ERS2                        331
#define H2RES                         332
#define H2FES                         333
#define SLPC1CON0                     334
#define SC1INS                        335
#define SCS1TSS0                      336
#define SC1TSS                        337
#define SCS1TSS1                      338
#define SC1POL                        339
#define SC1MRPE                       340
#define SC1EN                         341
#define SLPC1CON1                     342
#define SC1ISET                       343
#define SC1ISET0                      344
#define SC1ISET1                      345
#define SC1ISET2                      346
#define SC1ISET3                      347
#define SC1RNG                        348
#define ANSELA                        349
#define ANSA0                         350
#define ANSA1                         351
#define ANSA2                         352
#define ANSA4                         353
#define ANSELC                        354
#define ANSC0                         355
#define ANSC1                         356
#define ANSC2                         357
#define ANSC3                         358
#define APFCON                        359
#define T1GSEL                        360
#define OSCTUNE                       361
#define TUN0                          362
#define TUN                           363
#define TUN1                          364
#define TUN2                          365
#define TUN3                          366
#define TUN4                          367
#define PMCON1                        368
#define RD                            369
#define WR                            370
#define WREN                          371
#define PMCON2                        372
#define PMADRL                        373
#define PMADRH                        374
#define PMDATL                        375
#define PMDATH                        376
#define COG1PHR                       377
#define G1PHR                         378
#define G1PHR0                        379
#define G1PHR1                        380
#define G1PHR2                        381
#define G1PHR3                        382
#define COG1PHF                       383
#define G1PHF0                        384
#define G1PHF                         385
#define G1PHF1                        386
#define G1PHF2                        387
#define G1PHF3                        388
#define COG1BKR                       389
#define G1BKR                         390
#define G1BKR0                        391
#define G1BKR1                        392
#define G1BKR2                        393
#define G1BKR3                        394
#define COG1BKF                       395
#define G1BKF                         396
#define G1BKF0                        397
#define G1BKF1                        398
#define G1BKF2                        399
#define G1BKF3                        400
#define COG1DBR                       401
#define G1DBR                         402
#define G1DBR0                        403
#define G1DBR1                        404
#define G1DBR2                        405
#define G1DBR3                        406
#define COG1DBF                       407
#define G1DBF                         408
#define G1DBF0                        409
#define G1DBF1                        410
#define G1DBF2                        411
#define G1DBF3                        412
#define COG1CON0                      413
#define G1MD                          414
#define G1LD                          415
#define G1POL0                        416
#define G1POL1                        417
#define G1OE0                         418
#define G1OE1                         419
#define G1EN                          420
#define COG1CON1                      421
#define G1CS                          422
#define G1CS0                         423
#define G1CS1                         424
#define G1FDBTS                       425
#define G1RDBTS                       426
#define COG1RIS                       427
#define G1RIC1                        428
#define G1RIC2                        429
#define C1RICCP1                      430
#define G1RIFLT                       431
#define G1RIT2M                       432
#define G1R1HLT1                      433
#define G1RIHLT2                      434
#define COG1RSIM                      435
#define G1RMC1                        436
#define G1RMC2                        437
#define G1RMCCP1                      438
#define G1RMFLT                       439
#define G1RTM2M                       440
#define G1RMHLT1                      441
#define G1RMHLT2                      442
#define COG1FIS                       443
#define G1FIC1                        444
#define G1FIC2                        445
#define G1FICCP1                      446
#define G1FIFLT                       447
#define G1FIT2M                       448
#define G1FIHLT1                      449
#define G1FIHLT2                      450
#define COG1FSIM                      451
#define G1FMC1                        452
#define G1FMC2                        453
#define G1FMCCP1                      454
#define G1FMFLT                       455
#define G1FMT2M                       456
#define G1FMHLT1                      457
#define G1FMHLT2                      458
#define COG1ASD0                      459
#define G1ASD0L                       460
#define G1ASD0L0                      461
#define G1ASD0L1                      462
#define G1ASD1L                       463
#define G1ASD1L0                      464
#define G1ASD1L1                      465
#define G1ARSEN                       466
#define G1ASDE                        467
#define COG1ASD1                      468
#define G1ASDSFLT                     469
#define G1ASDSC1                      470
#define G1ASDSC2                      471
#define G1ASDSHLT1                    472
#define G1ASDSHLT2                    473

#endif // _PIC16F753_H_
